# 07. 하나의 테이블에 대한 조작

In [2]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
db = create_engine("postgresql+psycopg2://postgres:skt1faker@localhost:5432/PostgreSQL", 
     echo=False) 
def query(query_state, db=db):
    return pd.read_sql(query_state, db)

# 
# 
# 
### 7-1 그룹의 특징 잡기

In [4]:
query("SELECT * FROM review;")

  user_id product_id  score
0    U001       A001    4.0
1    U001       A002    5.0
2    U001       A003    5.0
3    U002       A001    3.0
4    U002       A002    3.0
5    U002       A003    4.0
6    U003       A001    5.0
7    U003       A002    4.0
8    U003       A003    4.0

# 
### 테이블 전체의 특징 계샨

In [7]:
query(""" 
SELECT 
    COUNT(*) AS total_count,
    COUNT(DISTINCT user_id) AS user_count,
    COUNT(DISTINCT product_id) AS product_count,
    SUM(score) AS sum,
    AVG(score) AS avg,
    MAX(score) AS max,
    MIN(score) AS min
FROM review;""")

   total_count  user_count  product_count   sum       avg  max  min
0            9           3              3  37.0  4.111111  5.0  3.0

# 
### 그루핑한 데이터의 특징 계산
- **```GROUP BY```구문에 지정한 컬럼 또는 집약 함수만 ```SELECT```구문의 열로 지정 가능**

In [8]:
query(""" 
SELECT user_id,
    COUNT(*) AS total_count,
    COUNT(DISTINCT product_id) AS product_count,
    SUM(score) AS sum,
    AVG(score) AS avg,
    MAX(score) AS max,
    MIN(score) AS min
FROm review GROUP BY user_id""")

  user_id  total_count  product_count   sum       avg  max  min
0    U001            3              3  14.0  4.666667  5.0  4.0
1    U002            3              3  10.0  3.333333  4.0  3.0
2    U003            3              3  13.0  4.333333  5.0  4.0

# 
### 집계 함수를 적용한 값과 집계 전의 값을 동시에 계산
### **```OVER(PARTITION BY 변수)``` : 변수 별 집계 적용**

In [10]:
query(""" 
SELECT user_id, product_id, score,
    AVG(score) OVER() AS avg_score,
    AVG(score) OVER(PARTITION BY user_id) AS user_avg_score,
    score - AVG(score) OVER(PARTITION BY user_id) AS user_avg_score_diff
FROM review;""")

  user_id product_id  score  avg_score  user_avg_score  user_avg_score_diff
0    U001       A001    4.0   4.111111        4.666667            -0.666667
1    U001       A002    5.0   4.111111        4.666667             0.333333
2    U001       A003    5.0   4.111111        4.666667             0.333333
3    U002       A001    3.0   4.111111        3.333333            -0.333333
4    U002       A002    3.0   4.111111        3.333333            -0.333333
5    U002       A003    4.0   4.111111        3.333333             0.666667
6    U003       A001    5.0   4.111111        4.333333             0.666667
7    U003       A002    4.0   4.111111        4.333333            -0.333333
8    U003       A003    4.0   4.111111        4.333333            -0.333333

# 
# 
# 
### 7-2 그룹 내부의 순서

In [11]:
query("SELECT * FROM popular_products;")

  product_id category  score
0       A001   action   94.0
1       A002   action   81.0
2       A003   action   78.0
3       A004   action   64.0
4       D001    drama   90.0
5       D002    drama   82.0
6       D003    drama   78.0
7       D004    drama   58.0

# 
### ORDER BY 구문
- **```ROW_NUMBER()``` : 고유한 순서를 부여**
- **```RANK()``` : 공동 순위 허용**
- **```DENSE_RANK()``` : 공동 순위 허용, (공동 순위 다음에 있는 순위를 건너 뛰고 순위를 붙임)**
- **```LAG( 변수, n )``` : 변수의 앞의 행을 추출**
- **```LEAD( 변수, n )``` : 변수의 뒤의 행을 추출**

In [12]:
query("""
SELECT product_id, score,
    ROW_NUMBER() OVER(ORDER BY score DESC) AS row,
    RANK() OVER(ORDER BY score DESC) AS rank,
    DENSE_RANK() OVER(ORDER BY score DESC) AS dense_rank,

    LAG(product_id) OVER(ORDER BY score DESC) AS lag1,
    LAG(product_id, 2) OVER(ORDER BY score DESC) AS lag2,

    LEAD(product_id) OVER(ORDER BY score DESC) AS lead1,
    LEAD(product_id, 2) OVER(ORDER BY score DESC) AS lead2

FROM popular_products 
ORDER BY row;""")

  product_id  score  row  rank  dense_rank  lag1  lag2 lead1 lead2
0       A001   94.0    1     1           1  None  None  D001  D002
1       D001   90.0    2     2           2  A001  None  D002  A002
2       D002   82.0    3     3           3  D001  A001  A002  A003
3       A002   81.0    4     4           4  D002  D001  A003  D003
4       A003   78.0    5     5           5  A002  D002  D003  A004
5       D003   78.0    6     5           5  A003  A002  A004  D004
6       A004   64.0    7     7           6  D003  A003  D004  None
7       D004   58.0    8     8           7  A004  D003  None  None

# 
### ORDER BY 구문 + 집계 함수

- **```FIRST_VALUE( 변수 )``` : 변수의 첫 번째 값 추출**
- **```LAST_VALUE( 변수 )``` : 변수의 마지막 값 추출**

#### 윈도 프레임 지정
- ```ROWS BETWEEN 시작 AND 끝``` 
    - ```CURRENT_ROW``` (현재의 행) 
    - ```n PRECEDING``` (n행 앞) 
    - ```n FOLLOWING``` (n행 뒤) 
    - ```UNBOUNDED PRECEDING``` (이전의 행 전부) 
    - ```UNOUNDED FOLLOWING``` (이후의 행 전부)

In [13]:
query(""" 
SELECT product_id, score,
    ROW_NUMBER() OVER(ORDER BY score DESC) AS row,

    -- 누적합
    SUM(score) 
        OVER(ORDER BY score DESC 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS cum_score,
    
    -- 현재 행과 앞뒤의 행 하나씩, 총 3개 행의 평균
    AVG(score) 
        OVER(ORDER BY score DESC
            ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING) As local_avg,

    -- 가장 첫 번째 값
    FIRST_VALUE(product_id) 
        OVER(ORDER BY score DESC
            ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS first_value,
    
    -- 마지막 값
    LAST_VALUE(product_id)
        OVER(ORDER BY score DESC
            ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS last_value
FROM popular_products
ORDER BY row""")

  product_id  score  row  cum_score  local_avg first_value last_value
0       A001   94.0    1       94.0  92.000000        A001       D004
1       D001   90.0    2      184.0  88.666667        A001       D004
2       D002   82.0    3      266.0  84.333333        A001       D004
3       A002   81.0    4      347.0  80.333333        A001       D004
4       A003   78.0    5      425.0  79.000000        A001       D004
5       D003   78.0    6      503.0  73.333333        A001       D004
6       A004   64.0    7      567.0  66.666667        A001       D004
7       D004   58.0    8      625.0  61.000000        A001       D004

# 
- 프레임 지정별 ID 집계
### ```array_agg()``` : 배열 생성

In [14]:
query(""" 
SELECT product_id,
    ROW_NUMBER() OVER(ORDER BY score DESC) AS row,

    -- 가장 앞 순위부터 가장 뒷 순위까지의 범위를 배열로 집약
    array_agg(product_id) 
        OVER(ORDER BY score DESC
            ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS whole_agg,
    
    -- 가장 앞 순위부터 현재 순위 까지의 범위를 배열로 집약
    array_agg(product_id)
        OVER(ORDER BY score DESC 
            ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS cum_agg,
    
    -- 순위 하나 앞과 하나 뒤까지의 범위를 배열로 집약
    array_agg(product_id)
        OVER(ORDER BY score DESC 
            ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING) AS local_agg
FROM popular_products
WHERE category = 'action' 
ORDER BY row;""")

,product_id,row,whole_agg,cum_agg,local_agg
0,A001,1,"[A001, A002, A003, A004]",[A001],"[A001, A002]"
1,A002,2,"[A001, A002, A003, A004]","[A001, A002]","[A001, A002, A003]"
2,A003,3,"[A001, A002, A003, A004]","[A001, A002, A003]","[A002, A003, A004]"
3,A004,4,"[A001, A002, A003, A004]","[A001, A002, A003, A004]","[A003, A004]"

# 
### PARTITION BY와 ORDER BY 조합

In [15]:
query(""" 
SELECT category, product_id, score,

    ROW_NUMBER() 
        OVER(PARTITION BY category ORDER BY score DESC) AS row,
    
    RANK() 
        OVER(PARTITION BY category ORDER BY score DESC) AS rank,

    DENSE_RANK()
        OVER(PARTITION BY category ORDER BY score DESC) AS dense_rank
FROM popular_products
ORDER BY category, row;""")

  category product_id  score  row  rank  dense_rank
0   action       A001   94.0    1     1           1
1   action       A002   81.0    2     2           2
2   action       A003   78.0    3     3           3
3   action       A004   64.0    4     4           4
4    drama       D001   90.0    1     1           1
5    drama       D002   82.0    2     2           2
6    drama       D003   78.0    3     3           3
7    drama       D004   58.0    4     4           4

# 
#### 각 카테고리의 상위 n개 추출

In [16]:
query(""" 
SELECT * FROM 
    (SELECT category, product_id, score,
        ROW_NUMBER() 
            OVER(PARTITION BY acategory ORDER BY score DESC) AS rank
        FROM popular_products) AS popular_products_with_rank
WHERE rank <= 2
ORDER BY category, rank;""")

  category product_id  score  rank
0   action       A001   94.0     1
1   action       A002   81.0     2
2    drama       D001   90.0     1
3    drama       D002   82.0     2

# 
# 
# 
### 7-3 데이터 축 변환 (Pivot_wider)

# 

### 행을 열로 변환

In [ ]:
query("SELECT * FROM daily_kpi;")

In [21]:
query(""" 
SELECT dt,
    MAX(CASE WHEN indicator = 'impressions' THEN val END) AS impressions,
    MAX(CASE WHEN indicator = 'sessions' THEN val END) AS sessions,
    MAX(CASE WHEN indicator = 'users' THEN val END) AS users
FROM daily_kpi
GROUP BY dt
ORDER BY dt""")

           dt  impressions  sessions  users
0  2017-01-01         1800       500    200
1  2017-01-02         2000       700    250

# 
### 행을 쉼표로 구분한 문자열로 집약

In [22]:
query("SELECT * FROM purchase_detail_log;")

   purchase_id product_id  price
0       100001       A001   3000
1       100001       A002   4000
2       100001       A003   2000
3       100002       D001   5000
4       100002       D002   3000
5       100003       A001   3000

# 
- ```string_agg( 변수, 구분자 )``` : 변수의 값들을 구분자 단위로 하나의 문자열로 결합

In [24]:
query(""" 
SELECT purchase_id,
    string_agg(product_id, ',') AS product_ids,
    SUM(price) AS amount
FROM purchase_detail_log
GROUP BY purchase_id
ORDER BY purchase_id;""")

   purchase_id     product_ids  amount
0       100001  A001,A002,A003    9000
1       100002       D001,D002    8000
2       100003            A001    3000

# 
# 
# 
### 7-4 데이터 축 변환 (Pivot_longer)

# 

### 열을 행으로 변환

In [25]:
query("SELECT * FROM quarterly_sales;")

   year     q1     q2       q3       q4
0  2015  82000  83000  78000.0  83000.0
1  2016  85000  85000  80000.0  81000.0
2  2017  92000  81000      NaN      NaN

In [26]:
query(""" 
SELECT q.year,
    CASE
        WHEN p.idx = 1 THEN 'q1' 
        WHEN p.idx = 2 THEN 'q2'  
        WHEN p.idx = 3 THEN 'q3'  
        WHEN p.idx = 4 THEN 'q4' 
    END AS quarter,

    CASE
        WHEN p.idx = 1 THEN q.q1 
        WHEN p.idx = 2 THEN q.q2 
        WHEN p.idx = 3 THEN q.q3
        WHEN p.idx = 4 THEn q.q4
    END AS sales
FROM quarterly_sales AS q
    CROSS JOIN(
        SELECT 1 AS idx
        UNION ALL SELECT 2 AS idx
        UNION ALL SELECT 3 AS idx
        UNION ALL SELECT 4 AS idx
    ) AS p;""")

    year quarter    sales
0   2015      q1  82000.0
1   2015      q2  83000.0
2   2015      q3  78000.0
3   2015      q4  83000.0
4   2016      q1  85000.0
5   2016      q2  85000.0
6   2016      q3  80000.0
7   2016      q4  81000.0
8   2017      q1  92000.0
9   2017      q2  81000.0
10  2017      q3      NaN
11  2017      q4      NaN

# 
### 임의의 길이를 가진 배열을 행으로 전개

In [31]:
query("SELECT * FROM purchase_log;")

   purchase_id     product_ids
0       100001  A001,A002,A003
1       100002       D001,D002
2       100003            A001

# 
### ```string_to_array()``` : 문자열을 배열로 변환
### ```unnest()``` : 배열 분해

In [36]:
query("SELECT unnest(ARRAY['A001', 'A002', 'A003']) AS product_id")

  product_id
0       A001
1       A002
2       A003

In [39]:
query(""" 
SELECT purchase_id, product_id
FROM 
    purchase_log 
        CROSS JOIN unnest(string_to_array(product_ids, ',')) AS product_id;""")

# BigQuery : string_to_array대신 split 사용

   purchase_id product_id
0       100001       A001
1       100001       A002
2       100001       A003
3       100002       D001
4       100002       D002
5       100003       A001

# 
### ```regexp_split_to_table( 변수, 구분자 )``` : 구분자로 구분된 문자열을 행으로 전개 (PostgreSQL에서만 가능)

In [43]:
query(""" 
SELECT purchase_id, 
    regexp_split_to_table(product_ids, ',') AS product_id
FROM purchase_log;""")

   purchase_id product_id
0       100001       A001
1       100001       A002
2       100001       A003
3       100002       D001
4       100002       D002
5       100003       A001

# 
### 문자열을 행으로 전개 (PostgreSQL에서만 가능)
- 1부터 N까지의 정수를 하나의행으로 가지는 피벗 테이블

In [44]:
query(""" 
SELECT * 
FROM (
    SELECT 1 AS idx
    UNION ALL SELECT 2 AS idx
    UNION ALL SELECT 3 AS idx) AS pivot;""")

   idx
0    1
1    2
2    3

# 
- split_part

In [45]:
query(""" 
SELECT 
    split_part('A002.A002.A003', '.', 1) AS part1,
    split_part('A002.A002.A003', '.', 2) AS part2,
    split_part('A002.A002.A003', '.', 3) AS part3;""")

  part1 part2 part3
0  A002  A002  A003

# 
### ```char_length()``` : 문자열의 길이

# 
- 문자 수의 차이를 이용해 상품 수 계산

In [48]:
query(""" 
SELECT purchase_id, product_ids,
    1 + char_length(product_ids) - char_length(replace(product_ids, ',', '')) AS product_num
FROM purchase_log;""")

   purchase_id     product_ids  product_num
0       100001  A001,A002,A003            3
1       100002       D001,D002            2
2       100003            A001            1

# 
- 피벗 테이블을 사용해 문자열을 행으로 전개

In [56]:
query(""" 
SELECT l.purchase_id, l.product_ids,
    p.idx,
    split_part(l.product_ids, ',', p.idx) AS product_id
FROM purchase_log AS l
    JOIN (
        SELECT 1 AS idx
        UNION ALL SELECT 2 AS idx
        UNION ALL SELECT 3 AS idx
    ) AS p
    ON p.idx <= 
        (1 + char_length(l.product_ids) 
        - char_length(replace(l.product_ids, ',', '')));""")

   purchase_id     product_ids  idx product_id
0       100001  A001,A002,A003    1       A001
1       100001  A001,A002,A003    2       A002
2       100001  A001,A002,A003    3       A003
3       100002       D001,D002    1       D001
4       100002       D001,D002    2       D002
5       100003            A001    1       A001